import Container from "../../components/container/Container"
import { Instagram } from "lucide-react"

import enamad from '../../assets/images/enamad.png'

import './Footer.css'

function Footer() {
    let items = [{
        id: 0, text: 'لوکس'
    }, {
        id: 1, text: 'قدیمی'
    }, {
        id: 2, text: 'مدرن'
    }]
    return (
        <footer className="bg-neutral2 w-full h-[22rem] mt-32 items-center flex footer-l">
            <Container>
                <div className="flex justify-between footer">
                    <div className="flex w-2/5 flex-col gap-6 wp-100">
                        <h4 className="text-2xl text-primary font-bold logo footer-logo">
                            ایرانی فرش
                        </h4>
                        <p className="text-neutral0 text-base/relaxed footer-text">
                            با ایرانی فرش همراه باشید و از زیبایی و شگفتی های فرش های متنوع و با کیفیت ما لذت ببرید. خرید آسان، تحویل سریع و خدمات پس از فروش حرفه ای، تنها چندی از ویژگی های خرید از ماست. با ایرانی فرش یک خرید آسان و لذت بخش را تجربه کنید.
                        </p>
                        <div className="flex justify-between items-center">
                            <div className="flex flex-col gap-4 font-normal">
                                <span className="text-neutral0 text-xl footer-text">تلفن پشتیبانی:  ۰۲۱۲۵۴۴</span>
                                <div className="flex gap-6">
                                    <a href="#">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M23.04 0H0.96C0.429 0 0 0.429 0 0.96V23.04C0 23.571 0.429 24 0.96 24H23.04C23.571 24 24 23.571 24 23.04V0.96C24 0.429 23.571 0 23.04 0ZM7.119 20.451H3.558V8.997H7.119V20.451ZM5.34 7.431C4.93178 7.431 4.53273 7.30995 4.1933 7.08315C3.85388 6.85636 3.58933 6.534 3.43311 6.15686C3.27689 5.77971 3.23602 5.36471 3.31566 4.96433C3.3953 4.56396 3.59188 4.19619 3.88053 3.90753C4.16919 3.61888 4.53696 3.4223 4.93733 3.34266C5.33771 3.26302 5.75271 3.30389 6.12986 3.46011C6.50701 3.61633 6.82936 3.88088 7.05615 4.2203C7.28295 4.55973 7.404 4.95878 7.404 5.367C7.401 6.507 6.477 7.431 5.34 7.431ZM20.451 20.451H16.893V14.88C16.893 13.551 16.869 11.844 15.042 11.844C13.191 11.844 12.906 13.29 12.906 14.784V20.451H9.351V8.997H12.765V10.563H12.813C13.287 9.663 14.448 8.712 16.182 8.712C19.788 8.712 20.451 11.085 20.451 14.169V20.451Z" fill="#505050" />
                                        </svg>
                                    </a>
                                    <a href="#">
                                        <svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
                                            <path d="M19.5525 2.99691C19.3117 3.01443 19.0754 3.07091 18.8527 3.16416H18.8497C18.636 3.24891 17.6197 3.67641 16.0747 4.32441L10.5382 6.65616C6.56547 8.32866 2.66022 9.97566 2.66022 9.97566L2.70672 9.95766C2.70672 9.95766 2.43747 10.0462 2.15622 10.2389C1.98246 10.3495 1.83295 10.4941 1.71672 10.6642C1.57872 10.8667 1.46772 11.1764 1.50897 11.4967C1.57647 12.0382 1.92747 12.3629 2.17947 12.5422C2.43447 12.7237 2.67747 12.8084 2.67747 12.8084H2.68347L6.34572 14.0422C6.50997 14.5694 7.46172 17.6984 7.69047 18.4192C7.82547 18.8497 7.95672 19.1189 8.12097 19.3244C8.20047 19.4294 8.29347 19.5172 8.40522 19.5877C8.46331 19.6215 8.52526 19.6481 8.58972 19.6672L8.55222 19.6582C8.56347 19.6612 8.57247 19.6702 8.58072 19.6732C8.61072 19.6814 8.63097 19.6844 8.66922 19.6904C9.24897 19.8659 9.71472 19.5059 9.71472 19.5059L9.74097 19.4849L11.9032 17.5162L15.5272 20.2964L15.6097 20.3317C16.365 20.6632 17.13 20.4787 17.5342 20.1532C17.9415 19.8254 18.0997 19.4062 18.0997 19.4062L18.126 19.3387L20.9265 4.99191C21.006 4.63791 21.0262 4.30641 20.9385 3.98466C20.848 3.65903 20.639 3.37897 20.3527 3.19941C20.1123 3.05325 19.8335 2.9827 19.5525 2.99691ZM19.4767 4.53441C19.4737 4.58166 19.4827 4.57641 19.4617 4.66716V4.67541L16.6875 18.8729C16.6755 18.8932 16.6552 18.9374 16.5997 18.9817C16.5412 19.0282 16.4947 19.0574 16.251 18.9607L11.8185 15.5624L9.14097 18.0029L9.70347 14.4104L16.9455 7.66041C17.244 7.38291 17.1442 7.32441 17.1442 7.32441C17.1652 6.98391 16.6935 7.22466 16.6935 7.22466L7.56147 12.8819L7.55847 12.8669L3.18147 11.3932V11.3902L3.17022 11.3879C3.17789 11.3854 3.1854 11.3824 3.19272 11.3789L3.21672 11.3669L3.23997 11.3587C3.23997 11.3587 7.14822 9.71166 11.121 8.03916C13.11 7.20141 15.114 6.35766 16.6552 5.70666C17.5693 5.32191 18.4843 4.93941 19.4002 4.55916C19.4617 4.53516 19.4325 4.53441 19.4767 4.53441Z" fill="#505050" />
                                        </svg>
                                    </a>
                                    <a href="#">
                                        <Instagram className="text-neutral0"></Instagram>
                                    </a>
                                </div>
                            </div>
                            <div>
                                <img src={enamad} alt="" />
                            </div>
                        </div>
                    </div>
                    <div className="flex w-2/5 gap-4 wp-100">
                        <Cat title='فرش های  دست بافت' items={items} />
                        <Cat title='فرش های ماشینی' items={items} />
                        <Cat title='سایر فرش ها' items={items}/>
                    </div>
                </div>
            </Container>
        </footer>
    )
}

function Cat({items , title}) {
    return (
        <div className="flex flex-col w-full gap-4">
            <h6 className="text-neutral0 border-b border-neutral3 w-full font-bold text-base footer-text">{title}</h6>
            <ul>
                {items.map((i) => {
                    return (<li key={i.id} className="text-neutral9 h-9 font-medium footer-text">
                        <a href="#">{i.text}</a>
                    </li>)
                })}
            </ul>
        </div>
    )
}

export default Footer